#Requires AutoHotkey v2.0
#SingleInstance Force

; JISキーボードの物理位置をUSキーボード配列の記号にリマップする

SC029::`    ; 半角/全角 → `
+SC029::~   ; Shift+半角/全角 → ~
+2::@       ; Shift+2 (") → @
+6::^       ; Shift+6 (&) → ^
+7::&       ; Shift+7 (') → &
+8::*       ; Shift+8 (() → *
+9::(       ; Shift+9 ()) → (
+0::)       ; Shift+0 ( ) → )
+-::_       ; Shift+- (=) → _
^::=        ; ^キー → =
+^::+       ; Shift+^ (~) → +

@::[        ; @キー → [
+@::`{      ; Shift+@ (`) → {
[::]        ; [キー → ]
+[::}       ; Shift+[ ({) → }

:::'        ; :キー → '
+;:::       ; Shift+; (+) → :
*::"        ; Shift+: (*) → "
]::\        ; ]キー → \
+]::|       ; Shift+] (}) → |
